//4 задача: Заполнить двумерный массив: если сумма номера строки и номера столбца - нечётное число, то такой элемент = 0;
//Все остальные элементы заполняются от 1 до 9 по порядку.
#include <iostream>
using namespace std;
int main()
{
    int tmp = 1; 
    const int n = 10;
    int a[n][n];
    for (int i =0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            if ((i+j)%2 == 1)
            {
                a[i][j] = 0;
            }
            else
            {
                a[i][j] = tmp;
                tmp++;
                if (tmp == 10)
                {
                    tmp = 1;
                }
                
            }
            cout << a[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}


/*
    Test 1

1 0 2 0 3 0 4 0 5 0
0 6 0 7 0 8 0 9 0 1
2 0 3 0 4 0 5 0 6 0
0 7 0 8 0 9 0 1 0 2
3 0 4 0 5 0 6 0 7 0
0 8 0 9 0 1 0 2 0 3
4 0 5 0 6 0 7 0 8 0
0 9 0 1 0 2 0 3 0 4
5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5

    Test 2

1 0 2 0 3
0 4 0 5 0
6 0 7 0 8
0 9 0 1 0
2 0 3 0 4

    Test 3

1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 0
0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9
*/
